trade/src/DataProcessors/ПанельУправленияСервисомПрогнозирования/ПанельУправленияСервисомПрогнозирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПанельУправленияСервисомПрогнозирования</name>
</mdclass:DataProcessor>

trade/src/InformationRegisters/СтатусыОбменаДаннымиССервисомПрогнозированияПродаж/СтатусыОбменаДаннымиССервисомПрогнозированияПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыОбменаДаннымиССервисомПрогнозированияПродаж</name>
  <attributes>
    <name>ОбменДаннымиАктивен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоРасписанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружаемаяСейчасКоллекция</name>
    <type>
      <types>EnumRef.КоллекцииСервисаПрогнозированияПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапланированоВыгрузитьОбъектовКоллекции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыгруженоОбъектовКоллекции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОшибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапланированоВыгрузитьКоллекций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыгруженоКоллекций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновленияЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/InformationRegisters/КоллекцииСервисаПрогнозированияПродаж/КоллекцииСервисаПрогнозированияПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КоллекцииСервисаПрогнозированияПродаж</name>
  <attributes>
    <name>ИдКоллекции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененФормат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененыОтборы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктуальности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПоследнейВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДанныхВыгруженное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДанныхНаСервере</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Коллекция</name>
    <type>
      <types>EnumRef.КоллекцииСервисаПрогнозированияПродаж</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/InformationRegisters/СервисПрогнозированияИдентификаторыОбучения/СервисПрогнозированияИдентификаторыОбучения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СервисПрогнозированияИдентификаторыОбучения</name>
  <resources>
    <name>СтатусОбучения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяИзмененияСостояния</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Готовность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидПлана</name>
    <type>
      <types>CatalogRef.ВидыПланов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдОбучения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/DataProcessors/ПанельУправленияСервисомПрогнозирования/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Начать прогнозирование.
// 
// Параметры:
//  ПараметрыПроцедуры - Структура - 
//  АдресХранилища- Строка - 
Процедура НачатьПрогнозирование(ПараметрыПроцедуры, АдресХранилища) Экспорт
	
	ВидПлана = ПараметрыПроцедуры.ВидПлана;
	ТребуетсяПолнаяВыгрузка = ПараметрыПроцедуры.ТребуетсяПолнаяВыгрузка;
	ТребуетсяРасчетПрогноза = ПараметрыПроцедуры.ТребуетсяРасчетПрогноза;
	
	// Предварительная установка флага начала выгрузки до вызова "ВыгрузитьКоллекции" для контроля наличия выгрузки.
	СводкаОбменаДанными = РегистрыСведений.СтатусыОбменаДаннымиССервисомПрогнозированияПродаж.ПолучитьСтатусыОбменаДанными();
	СводкаОбменаДанными.ОбменДаннымиАктивен = Истина;
	СводкаОбменаДанными.ЗапланированоВыгрузитьКоллекций = 0;
	СводкаОбменаДанными.ВыгруженоОбъектовКоллекции = 0;
	СводкаОбменаДанными.ЗапланированоВыгрузитьОбъектовКоллекции = 0;
	СводкаОбменаДанными.ВыгружаемаяСейчасКоллекция = Перечисления.КоллекцииСервисаПрогнозированияПродаж.ПустаяСсылка();
	РегистрыСведений.СтатусыОбменаДаннымиССервисомПрогнозированияПродаж.ЗаписатьСтатусыОбменаДанными(СводкаОбменаДанными);
	
	Если ТребуетсяПолнаяВыгрузка Тогда
		НастройкиСервиса = СервисПрогнозирования.ПолучитьНастройкиСервиса();
		Для Каждого Коллекция Из НастройкиСервиса.Коллекции Цикл
			ОписаниеКоллекции = Коллекция.Значение;
			Если Не ОписаниеКоллекции.Выгружать Тогда
				Продолжить;
			КонецЕсли;
			
			ИнфоКоллекции = РегистрыСведений.КоллекцииСервисаПрогнозированияПродаж.ПолучитьИнформациюКоллекции(Коллекция.Ключ);
			Если РегистрыСведений.КоллекцииСервисаПрогнозированияПродаж.КоллекцияВыгружалась(Коллекция.Ключ) Тогда
				// Коллекция будет удалена на сервере в методе СоздатьКоллекции.
				ИнфоКоллекции.ИзмененФормат = Истина;
				Если Не ОписаниеКоллекции.Категориальный Тогда
					// При выгрузке будет автоматически сброшена дата актуальности.
					ИнфоКоллекции.ИзмененыОтборы = Истина;
				КонецЕсли;
				РегистрыСведений.КоллекцииСервисаПрогнозированияПродаж.ЗаписатьИнформациюКоллекции(
					Коллекция.Ключ, ИнфоКоллекции);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	РегистрыСведений.ЖурналСервисаПрогнозирования.ПроверитьОчиститьЖурналСервисаПрогнозирования();
	
	// 1. Выгрузка данных.
	СервисПрогнозирования.СоздатьКоллекции();
	СервисПрогнозирования.ВыгрузитьКоллекции();
	
	// Индивидуальные для видов планов настройки
	
	Если ТребуетсяРасчетПрогноза Тогда
		// 2. Проверка наличия модели и ее конфигурации, создание.
		СервисПрогнозирования.ПроверитьСоздатьМодель(ВидПлана);
		СервисПрогнозирования.ПроверитьСоздатьКонфигурациюМодели(ВидПлана);
		
		// 3. Запрос прогноза.
		СервисПрогнозирования.ЗапуститьОбучение(ВидПлана);
	КонецЕсли;
	
КонецПроцедуры

// Создать при отсутствии модель и/или обновить ее конфигурацию в сервисе.
// 
// Параметры:
//  ВидПлана - СправочникСсылка.ВидыПланов - 
// 
// Возвращаемое значение:
//  Строка
Функция ОбновитьМодельВСервисе(ВидПлана) Экспорт
	
	Ответ = СервисПрогнозирования.ПроверитьСоздатьМодель(ВидПлана);
	Если Не ПустаяСтрока(Ответ.ТекстОшибки) Тогда
		Возврат Ответ.ТекстОшибки;
	КонецЕсли;
	
	Ответ = СервисПрогнозирования.ПроверитьСоздатьКонфигурациюМодели(ВидПлана);
	Если Не ПустаяСтрока(Ответ.ТекстОшибки) Тогда
		Возврат Ответ.ТекстОшибки;
	КонецЕсли;
	
	Возврат Ответ.ТекстОшибки;
	
КонецФункции

// Запустить обучение прогноза в сервисе прогнозирования продаж.
// 
// Параметры:
//  ВидПлана - СправочникСсылка.ВидыПланов - 
// 
// Возвращаемое значение:
//  Строка
Функция ОбновитьПрогнозНаСервере(ВидПлана) Экспорт
	
	Ответ = СервисПрогнозирования.ЗапуститьОбучение(ВидПлана);
	Если Не ПустаяСтрока(Ответ.ТекстОшибки) Тогда
		Возврат Ответ.ТекстОшибки;
	КонецЕсли;
	
	Возврат Ответ.ТекстОшибки;
	
КонецФункции

// Загрузить прогноз из сервиса прогнозирования продаж.
// 
// Параметры:
//  ВидПлана - СправочникСсылка.ВидыПланов - 
//  ГотовКПолучениюИлиЗагруженНаМоментВызова - Булево - Обучение завершено на момент вызова метода.
//  ИмяМодели - Строка - 
// 
// Возвращаемое значение:
//  Строка
Функция ЗагрузитьДанныеИзСервиса(ВидПлана, ГотовКПолучениюИлиЗагруженНаМоментВызова = Ложь, ИмяМодели = Неопределено) Экспорт
	
	СтатусОбучения = Неопределено;
	Если Не ГотовКПолучениюИлиЗагруженНаМоментВызова Тогда
		ИнфоСтатусаОбучения = СервисПрогнозирования.ПолучитьСтатусОбучения(ВидПлана);
		ТекстОшибки = ИнфоСтатусаОбучения.ТекстОшибки;
		Если ИнфоСтатусаОбучения.Свойство("Статус") Тогда
			СтатусОбучения = ИнфоСтатусаОбучения.Статус;
		КонецЕсли;
	Иначе
		ИнфоСтатусаОбученияЗагружен = РегистрыСведений.СервисПрогнозированияИдентификаторыОбучения.ИдентификаторыОбученияВидаПлана(ВидПлана, Ложь);
		ИнфоСтатусаОбученияОбучен = РегистрыСведений.СервисПрогнозированияИдентификаторыОбучения.ИдентификаторыОбученияВидаПлана(ВидПлана, Истина);
		Если ИнфоСтатусаОбученияЗагружен = Неопределено Тогда
			Если ИнфоСтатусаОбученияОбучен = Неопределено Тогда
				Возврат ТекстНеНайденаИнформацияОбученияЗагрузкиМодели();
			КонецЕсли;
			ИнфоСтатусаОбучения = ИнфоСтатусаОбученияОбучен;
		ИначеЕсли ИнфоСтатусаОбученияОбучен = Неопределено Тогда
			ИнфоСтатусаОбучения = ИнфоСтатусаОбученияЗагружен;
		ИначеЕсли ИнфоСтатусаОбученияОбучен.ВремяИзмененияСостояния > ИнфоСтатусаОбученияЗагружен.ВремяИзмененияСостояния Тогда
			ИнфоСтатусаОбучения = ИнфоСтатусаОбученияОбучен;
		Иначе
			ИнфоСтатусаОбучения = ИнфоСтатусаОбученияЗагружен;
		КонецЕсли;
		ТекстОшибки = ИнфоСтатусаОбучения.ТекстОшибки;
		Если ИнфоСтатусаОбучения.Свойство("СтатусОбучения") Тогда
			СтатусОбучения = ИнфоСтатусаОбучения.СтатусОбучения;
		КонецЕсли;
	КонецЕсли;
	
	Если ИнфоСтатусаОбучения <> Неопределено
		И (СтатусОбучения = СервисПрогнозирования.СтатусГотовКПолучению()
			Или СтатусОбучения = СервисПрогнозирования.СтатусЗагружен())
		И ПустаяСтрока(ТекстОшибки)
		И ГотовКПолучениюИлиЗагруженНаМоментВызова Тогда
		Ответ = СервисПрогнозирования.ПолучитьПрогнозСервиса(ВидПлана, ИнфоСтатусаОбучения.ИдОбучения, ИмяМодели);
		ТекстОшибки = Ответ.ТекстОшибки;
	КонецЕсли;
	
	Возврат ТекстОшибки;
	
КонецФункции

Функция ПодключениеТестовогоПериодаДоступно() Экспорт
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПодключениеСервисовСопровождения") Тогда
		Возврат Ложь;
	КонецЕсли;
	ИдентификаторСервиса = СервисПрогнозированияПереопределяемыйКлиентСервер.ИдентификаторСервиса();
	
	Результат = Новый Соответствие;
	Результат.Вставить(ИдентификаторСервиса, Ложь);
	
	Идентификаторы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторСервиса);
	МодульПодключениеСервисовСопровождения = ОбщегоНазначения.ОбщийМодуль("ПодключениеСервисовСопровождения");
	ОписательДоступности = МодульПодключениеСервисовСопровождения.ДоступноПодключениеТестовогоПериода(Идентификаторы);
	Если Не ОписательДоступности.Ошибка Тогда
		Результат.Вставить(
			ИдентификаторСервиса, 
			ОписательДоступности.СервисыСопровождения[ИдентификаторСервиса] = "Доступно");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстНеНайденаИнформацияОбученияЗагрузкиМодели()
	
	ТекстОшибки = НСтр("ru='По выбранному виду плана не найдена информация по обучению и загрузке модели.'");
	Возврат ТекстОшибки;
	
КонецФункции

#КонецОбласти

#КонецЕсли
